## Lecture 8 Notes

#### Pandas is an enormous package and is used to import data, to manipulate data, to do calculations with data, and even create graphs and plots using the data.

In [2]:
import pandas as pd
import numpy as np

#### This is houw to import data from github using pandas

In [4]:
# Import the file https://raw.githubusercontent.com/juanklopper/TutorialData/main/PUBH1142Chap0801.csv from GitHub and assign it to the variable df
df = pd.read_csv('https://raw.githubusercontent.com/juanklopper/TutorialData/main/PUBH1142Chap0801.csv')

In [6]:
# Print the first 20 methods and attributes of df suing the dir function
dir(df)[:20]

['Age',
 'CholesterolAfter',
 'CholesterolBefore',
 'DOB',
 'Delta',
 'Group',
 'HR',
 'Name',
 'Smoke',
 'Survey',
 'T',
 'TAG',
 'Vocation',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__']

In [7]:
# Use the head method to print the first 5 rows of df
df.head()

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active

In [8]:
# Print the shape of df
df.shape   #Attribute

(200, 13)

In [9]:
# Print the columns of df
df.columns

Index(['Name', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

In [10]:
# Print the dimensions of df
df.ndim

2

In [12]:
# Print the size of df
df.size

2600

#### One of the most important functions: It tells you if the data is in the right format. If it's not, you have to go back and clean the date. Ex: age should be an int (integer) so if it comes back as an object, you know there's something wrong with the data

In [13]:
# Print the type of df
df.dtypes

Name                  object
DOB                   object
Age                    int64
Vocation              object
Smoke                  int64
HR                     int64
sBP                    int64
CholesterolBefore    float64
TAG                  float64
Survey                 int64
CholesterolAfter     float64
Delta                float64
Group                 object
dtype: object

In [17]:
# Assign the Age column in df to the variable age_column
age_column = df['Age']

# Print the type of age_column
type(age_column)

# Assign the Age column in df to the variable age_column and use dot notation
age_column = df.Age

In [18]:
# Print the first 5 rows of age_column
age_column.head()

0    43
1    53
2    33
3    43
4    46
Name: Age, dtype: int64

In [20]:
# Convert the age_column to a numpy array and assign it to the variable age
age = age_column.to_numpy()

# Print the type of age
type(age)

numpy.ndarray

In [22]:
# Calculate the mean, min and max age in age_column
age_column.mean()

75

In [23]:
age_column.min()

30

In [24]:
age_column.max()

75

In [25]:
age_column.describe()

count    200.000000
mean      53.070000
std       12.553207
min       30.000000
25%       43.000000
50%       54.000000
75%       64.000000
max       75.000000
Name: Age, dtype: float64

In [26]:
# Select rows 2, 5, and 7 using the iloc method
df.iloc[[1, 4, 6]]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active
6,Frank Zimmerman,1981-03-04,54,Police officer,0,60,129,2.9,2.4,1,2.6,0.3,Active